// рекурсия. на примере фрактала и уробороса
// это процесс, который вызывает сам себя. эту функцию называют рекурсивной . вызов этой функции называется рекурсивным
// вызовом. пример кода: открытие матрешки, код с ошибками!!!
/*
 * 
 * 
 * 
 void OpenMatryoshka (int size) // это рекурсивная функция
{
    Console.WriteLine($"Opening matryoshka of size {size}...");
    OpenMatryoshka(size); // это рекурсивный вызов
}
// 
OpenMatryoshka(5); // вызов функции


// последний вызов функции это тривиальная задача. простая задача это задача с меньшим обьемом вычислений, то есть это базовый случай.
// на примере с матрешками- базовый случай это самая маленькая матрешка
условия остановки рекурсии :
    -текущая задача стала тривиальной (простой) задачей, об этом скажет значение параметра
    - рекурсивный вызов не требуется и функцию завершает метод return!;
    - условие размещается ПЕРЕД рекурсивным вызовом

    Function
    if(some_condition)
     STOP;

call Function;

пример кода: эта функция открывает матрешки до размера 1. то есть открытие матрешки номер 1 можно считать базовым случаем (тривиальной, простой задачей). добавляем условие и параметр равный единице, и когда size будет равен 1 то функция завершиться без рекурсивного вызова.
*/
void OpenMatryoshka (int size)
{
Console.WriteLine($" open russian doll of size {size}...");
if (size == 1)
{
Console.WriteLine(" reached the small russian doll!");
return;
}
OpenMatryoshka(size -1);
}

OpenMatryoshka(5);





