/* Задание 1. Совместная работа
Семинар 1. Знакомство с языками программирования
Напишите программу, которая на вход
принимает два целых числа и проверяет,
является ли первое число квадратом второго.
a = 25, b = 5 => да
a = 2, b = 10 => нет
a = 9, b = -3 => да
a = -3, b = 9 => нет 

Console.Write("введите первое число: ");
// string input a = Console.ReadLine();
int a = Convert.ToInt32(Console.ReadLine());

Console.Write("введите второе число: ");
// string input b = Console.ReadLine();
int b = Convert.ToInt32(Console.ReadLine());
//int result = b * b;
 if ( a ==  b * b ) //result) // b * b)
 {
    Console.Write(" первое число является квадратом второго ");
 }
 else 
 {
    Console.Write(" первое число не квадрат ");
 } */ 


 /* Напишите программу, которая на вход принимает
целое число N, а на выходе показывает все целые
числа в промежутке от -N до N.
Примеры
4 => -4, -3, -2, -1, 0, 1, 2, 3, 4
2 => -2, -1, 0, 1, 2


Console.Write(" введите число: ");
int n = Convert.ToInt32(Console.ReadLine());
// int i = 1;
int a = -n;
 while ( a <= n)
 {
    Console.Write(a);
    Console.Write(' ');
    a = a + 1;
 } 

 Задание 3*. Работа в сессионных залах
Семинар 1. Знакомство с языками программирования
Напишите программу, которая принимает на вход
трёхзначное целое число и на выходе показывает сумму
первой и последней цифры этого числа.
456 => 10
782 => 9
918 => 17 

Console.WriteLine(" введите трехзначное число: ");
int n = Convert.ToInt32(Console.ReadLine());
int a = n / 100;
int b = n % 10; 
int sum = (a + b); // / 10;

if (n < 100 || n > 1000)
{
    Console.Write("это не трехзначное число...");
}
else 
{
    Console.Write($" сумма первого и третьего числа {n} равна {sum} ");
} 



задача для меня, придумала сама: Напишите программу, которая принимает на вход
 целое число и на выходе показывает последнюю цифру этого числа.
456 => 6
782 => 2
918 => 8 

 Console.WriteLine(" введите число: ");
 int n = Convert.ToInt32(Console.ReadLine());
 int a = n % 10;
 Console.WriteLine(a); */
